PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/application/initial/Z4A/mza_main_Z4A.c
/**
 * @file mza_main_Z4A.c
 * C entry function for the Z4 A core. The core completes the HW initialization (clocks run
 * at full speed, peripheral bridge is widely opened, SMPU is configured) and initializes a
 * few I/O drivers, e.g. LED drivers and serial I/O with the host. Then it starts the
 * safe-RTOS kernel on the core Z4A. The other cores are not started in this initial
 * sample.\n
 *   Two regular tasks are spinning and driving an LED each. A third LED is commanded by
 * the idle task. Only if three LEDs are blinking everything is alright.\n
 *   Progress information is permanently written into the serial output channel. A terminal
 * on the development host needs to use these settings: 115000 Bd, 8 Bit data word, no
 * parity, 1 stop bit.
 *
 * Copyright (C) 2017-2024 Peter Vranken (mailto:Peter_Vranken@Yahoo.de)
 *
 * This program is free software: you can redistribute it and/or modify it
 * under the terms of the GNU Lesser General Public License as published by the
 * Free Software Foundation, either version 3 of the License, or any later
 * version.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public License
 * for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 */
/* Module interface
 *   main
 * Local functions
 *   taskInitProcess
 *   task1ms
 *   taskOs1ms
 *   startSecondaryCore
 */

/*
 * Include files
 */

#include "mza_main_Z4A.h"

#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include <math.h>
#include <assert.h>

#include "MPC5748G.h"
#include "typ_types.h"
#include "ccl_configureClocks.h"
#include "xbs_crossbarSwitch.h"

#include "rtos.h"
#include "gsl_systemLoad.h"
#include "siu_siuPortDriver.h"
#include "dma_dmaDriver.h"
#include "lbd_ledAndButtonDriver.h"
#include "sio_serialIO.h"
#include "del_delay.h"
#include "stm_systemTimer.h"



/*
 * Defines
 */
 
/** The demo can be compiled with a ground load. Most tasks produce some CPU load if this
    switch is set to 1. */
#define TASKS_PRODUCE_GROUND_LOAD   1


/*
 * Local type definitions
 */

/** The enumeration of all event processors, tasks and priorities, to have them as symbols
    in the source code. Most relevant are the event processor IDs. Actually, these IDs are
    provided by the RTOS at runtime, when creating the event processor. However, it is
    guaranteed that the IDs, which are dealt out by rtos_osCreateEventProcessor() form the
    series 0, 1, 2, .... So we don't need to have a dynamic storage of the IDs; we define
    them as constants and double-check by assertion that we got the correct, expected IDs
    from rtos_osCreateEventProcessor(). Note, this requires that the order of creating the
    event processors follows the order here in the enumeration.\n
      Here, we have the IDs of the created event processors. They occupy the index range
    starting from zero. */
enum idEventProcessor_t
{
    /** Event processor, which raises a regular timer event. */
    idEvProc1ms = 0,

    /** The number of event processors. */
    noRegisteredEventProcs
};


/** The RTOS uses constant priorities for its event processors, which are defined here.\n
      Note, the priority is a property of an event processor rather than of a task. A task
    implicitly inherits the priority of the event processor it is associated with. */
enum prioTask_t
{
    prioTaskIdle = 0,            /* Prio 0 is implicit, cannot be chosen explicitly */
    prioEv1ms = 1,
};


/** In safe-RTOS a task belongs to a process, characterized by the PID, 1..4. The
    relationship is defined here.\n
      Note, a process needs to be configured in the linker script (actually: assignment of
    stack space) before it can be used. */
enum pidOfTask_t
{
    pidOs = 0,              /* kernel always and implicitly has PID 0 */
    pidTask1ms = 1,
    pidTaskOs1ms = pidOs,   /* A kernel or operating system task, e.g. to implement a
                               polling I/O driver. */
    pidTaskIdle = pidOs     /* PID 0 is implicit, idle belongs to the kernel */
};


/*
 * Local prototypes
 */


/*
 * Data definitions
 */

/** Counter of cycles of infinite main loop. */
volatile unsigned long SBSS_OS(mza_cntTaskIdle) = 0;

/** Counter of cyclic 1ms user task. */
volatile unsigned long long SBSS_P1(mza_cntTask1ms) = 0;  

/** Counter of cyclic 1ms OS task. */
volatile unsigned long long SBSS_OS(mza_cntTaskOs1ms) = 0;

/** The average CPU load produced by all tasks and interrupts in tens of percent. */
unsigned int DATA_OS(mza_cpuLoad) = 1000;

/** Interface with assembly code: Here's a variable in the assembly startup code, which
    takes the addresses of the C main function to be invoked on core Z4B. It needs to be
    initialized prior to starting the core. Z4B and Z2 may use the same function.
      @todo Why can't we place the declaration locally into the function where it is used?
    The compiler rejects it due to the section attribute. */
extern void (*volatile SECTION(.bss.startup) sup_main_Z4B)(signed int, const char **);

/** Interface with assembly code: Here's a variable in the assembly startup code, which
    takes the addresses of the C main function to be invoked on core Z2. It needs to be
    initialized prior to starting the core. Z4B and Z2 may use the same function. */
extern void (*volatile SECTION(.bss.startup) sup_main_Z2)(signed int, const char **);


/*
 * Function implementation
 */


/**
 * Initialization task of process \a PID.
 *   @return
 * The function returns the Boolean decision, whether the initialization was alright and
 * the system can start up. "Not alright" is expressed by a negative number, which hinders
 * the RTOS to startup.
 *   @param PID
 * The ID of the process, the task function is executed in.
 *   @remark
 * In this sample, we demonstrate that different processes' tasks can share the same task
 * function implementation. This is meant a demonstration of the technical feasibility but
 * not of good practice; the implementation needs to use shared memory, which may break a
 * safety constraint, and it needs to consider the different privileges of the processes.
 */
static int32_t taskInitProcess(uint32_t PID)
{
    static unsigned int SHARED(cnt_) = 0;
    ++ cnt_;

    return cnt_ == PID? 0: -1;

} /* End of taskInitProcess */



/**
 * Test of LED and button driver: This callback is invoked on every state change of any of
 * the supported (two) buttons.
 *   @return
 * The function always returns zero (no error).
 *   @param PID
 * PID of process, which is registered for the callback.
 *   @param buttonState
 * Current state of both buttons and changes in the instance of calling. See enum
 * lbd_buttonStateMask_t for details.
 */
static int32_t onButtonChangeCallback(uint32_t PID ATTRIB_UNUSED, uint8_t buttonState)
{
    /* Test button input: The current status is echoed as LED status. */
    if((buttonState & lbd_btStMask_btnSw1_down) != 0)
        lbd_setLED(lbd_led_6_DS5,  /* isOn */ true);
    else if((buttonState & lbd_btStMask_btnSw1_released) != 0)
        lbd_setLED(lbd_led_6_DS5,  /* isOn */ false);
              
