PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/application/initial/Z4A/mza_main_Z4A.c
    /* Demonstrate the use of the serial interface. Note, the function is never blocking
       and we have left it for a long time before the character are visible in the console
       window. Never blocking: If the buffer has not enough space then an according number
       of characters is dropped rather than the function waiting for the buffer becoming
       empty. */
    #define GREETING "Hello World\r\n"
    sio_osWriteSerial(GREETING, /* noBytes */ sizeof(GREETING)-1);
    fputs("fputs saying " GREETING, stdout);
    printf("printf saying %s", GREETING);
    #undef GREETING
    
    /* Register the process initialization tasks. */
    bool initOk = true;
    if(rtos_osRegisterInitTask(taskInitProcess, /* PID */ 1, /* tiTaskMaxInUS */ 1000)
       != rtos_err_noError
      )
    {
        initOk = false;
    }

    /* Create the event processors that trigger application tasks at the RTOS. Note, we do
       not really respect the ID, which is assigned to the event processor by the RTOS API
       rtos_osCreateEventProcessor(). The returned value is redundant. This technique
       requires that we create the event processors in the right order and this requires in
       practice a double-check by assertion - later maintenance errors are unavoidable
       otherwise. */
    unsigned int idEvProc;
    if(rtos_osCreateEventProcessor
                ( &idEvProc
                , /* tiCycleInMs */               1
                , /* tiFirstActivationInMs */     10
                , /* priority */                  prioEv1ms
                , /* minPIDToTriggerThisEvProc */ RTOS_EVENT_PROC_NOT_USER_TRIGGERABLE
                , /* useCountableEvents */        false                               
                , /* taskParam */                 0
                )
       == rtos_err_noError
      )
    {
        assert(idEvProc == idEvProc1ms);

        if(rtos_osRegisterOSTask(idEvProc1ms, taskOs1ms) != rtos_err_noError)
            initOk = false;

        if(rtos_osRegisterUserTask( idEvProc1ms
                                  , task1ms
                                  , pidTask1ms
                                  , /* tiTaskMaxInUs */ 0
                                  )
           != rtos_err_noError
          )
        {
            initOk = false;
        }
    }
    else
        initOk = false;

    /* The last check ensures that we didn't forget to register a task. */
    assert(idEvProc == noRegisteredEventProcs-1);

    /* Initialize the RTOS kernel. The global interrupt processing is resumed if it
       succeeds. The step involves a configuration check. We must not startup the SW if the
       check fails. */
    if(!initOk ||  rtos_osInitKernel() != rtos_err_noError)
        while(true)
            ;

    /* The code down here becomes the idle task of the RTOS. We enter an infinite loop,
       where some background can be placed. */
    while(true)
    {
        /* Compute the average CPU load. Note, this operation lasts about 1.5s and has a
           significant impact on the cycling speed of this infinite loop. Furthermore, it
           measures only the load produced by the tasks and system interrupts but not that
           of the rest of the code in the idle loop. */
        mza_cpuLoad = gsl_osGetSystemLoad();

        char msg[128];
        const int noChar = sniprintf( msg, sizeof(msg)
                                    , "CPU load: %u%%\r\n"
                                    , (mza_cpuLoad+5)/10
                                    );
        assert((unsigned)noChar < sizeOfAry(msg));
        //sio_osWriteSerial(msg, (unsigned)noChar);
        sio_osWriteSerial(msg, (unsigned)noChar);

        static bool SBSS_OS(isOn_) = false;
        lbd_osSetLED(lbd_led_2_DS9, isOn_ = !isOn_);

        /* Make spinning of the idle task observable in the debugger. */
        ++ mza_cntTaskIdle;

        /* Supervisor code like an OS or the idle task must not use the C lib's I/O
           functions like printf because they go into a system call handler of class full,
           which is not permitted for use from supervisor code. */
        sio_osWriteSerial(SIO_STR(Hello World!));
        
    } /* End of inifinite idle loop of RTOS. */

    /* We never get here. Just to avoid a compiler warning. */
    return -1;

} /* End of main */
